using System;
using System.Collections.Generic;
using Windows.UI.Xaml;
using Windows.UI.Xaml.Controls;

namespace KTEAL_Serron
{
    public sealed partial class SchedulesPage : Page
    {
        private List<LineTimetable> LineTimetables;

        public SchedulesPage()
        {
            this.InitializeComponent();
            LineTimetables = new List<LineTimetable>();

        }

        private void Schedules_Page_Loading(FrameworkElement sender, object args)
        {
            // --------------------------------------------------------------------- Line Begin
            var Line = new LineTimetable("ΛΕΥΚΩΝΑΣ", 1, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "06:45",
                        "07:15",
                        "07:45",
                        "08:45",
                        "09:45",
                        "10:45",
                        "11:45",
                        "12:45",
                        "13:45",
                        "14:25",
                        "15:30",
                        "16:50",
                        "17:35",
                        "18:10",
                        "19:10",
                        "20:00"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "07:15",
                        "07:45",
                        "08:45",
                        "09:45",
                        "10:45",
                        "11:45",
                        "12:45",
                        "13:45",
                        "14:25"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΛΕΥΚΩΝΑΣ - ΜΗΤΡΟΥΣΙ", 1, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "15:15",
                        "16:00",
                        "18:00",
                        "20:00",
                        "21:35"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "09:05",
                        "11:05",
                        "14:05",
                        "18:15",
                        "20:00",
                        "21:35",
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΜΗΤΡΟΥΣΙ", 2, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "06:05",
                        "06:30",
                        "07:05",
                        "08:05",
                        "09:05",
                        "10:05",
                        "11:05",
                        "12:05",
                        "13:05",
                        "14:05",
                        "15:15",
                        "16:15",
                        "17:00",
                        "18:15",
                        "19:15",
                        "20:35",
                        "21:35"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "06:30",
                        "07:05",
                        "08:05",
                        "09:05",
                        "10:05",
                        "11:05",
                        "12:05",
                        "13:05",
                        "14:05",
                        "15:15",
                        "16:00",
                        "18:00",
                        "20:00",
                        "21:35"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "09:05",
                        "11:05",
                        "14:05",
                        "18:15",
                        "20:00",
                        "21:35"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΟΜΟΝΟΙΑ", 3, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "07:15",
                        "07:45",
                        "08:15",
                        "08:45",
                        "09:15",
                        "09:45",
                        "10:15",
                        "10:45",
                        "11:15",
                        "11:45",
                        "12:15",
                        "12:45",
                        "13:15",
                        "13:45",
                        "14:15",
                        "14:45"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΚΑΛΥΒΙΑ", 4, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "06:35",
                        "07:00",
                        "07:30",
                        "08:00",
                        "08:30",
                        "09:00",
                        "09:30",
                        "10:00",
                        "10:30",
                        "11:00",
                        "11:30",
                        "12:00",
                        "12:30",
                        "13:00",
                        "13:30",
                        "14:00",
                        "14:30",
                        "15:00",
                        "15:30",
                        "16:00",
                        "16:30",
                        "17:00",
                        "17:30",
                        "18:00",
                        "18:30",
                        "18:00",
                        "19:30",
                        "20:00",
                        "20:30",
                        "21:00",
                        "21:30",
                        "22:00",
                        "22:30"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "06:35",
                        "07:00",
                        "07:30",
                        "08:00",
                        "08:30",
                        "09:00",
                        "09:30",
                        "10:00",
                        "10:30",
                        "11:00",
                        "11:30",
                        "12:00",
                        "12:30",
                        "13:00",
                        "13:30",
                        "14:00",
                        "14:30",
                        "14:45",
                        "15:15",
                        "16:15",
                        "17:15",
                        "18:15",
                        "19:15",
                        "20:15",
                        "21:15",
                        "22:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "06:15",
                        "07:15",
                        "08:15",
                        "10:15",
                        "12:15",
                        "13:15",
                        "14:15",
                        "16:15",
                        "17:15",
                        "18:15",
                        "20:15",
                        "22:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("NIKAIA", 5, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "06:35",
                        "07:15",
                        "07:45",
                        "08:15",
                        "08:45",
                        "09:15",
                        "09:45",
                        "10:15",
                        "10:45",
                        "11:15",
                        "11:45",
                        "12:15",
                        "12:45",
                        "13:15",
                        "13:45",
                        "14:15",
                        "14:45",
                        "15:15",
                        "16:15",
                        "17:15",
                        "17:45",
                        "18:15",
                        "18:45",
                        "19:15",
                        "19:45",
                        "20:15",
                        "20:45",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "06:35",
                        "07:15",
                        "07:45",
                        "08:15",
                        "08:45",
                        "09:15",
                        "09:45",
                        "10:15",
                        "10:45",
                        "11:15",
                        "11:45",
                        "12:15",
                        "12:45",
                        "13:15",
                        "13:45",
                        "14:15",
                        "14:45",
                        "15:15",
                        "15:45",
                        "16:15",
                        "16:45",
                        "17:15",
                        "18:15",
                        "19:15",
                        "20:15",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "07:45",
                        "09:45",
                        "11:45",
                        "13:45",
                        "15:45",
                        "17:45",
                        "19:45"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΚΩΝΣΤΑΝΤΙΝΑΤΟ", 7, "ΚΑΘΕ ΤΡΙΤΗ");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "08:05"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΒΑΛΤΟΤΟΠΙ", 9, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                       "06:00",
                       "07:00",
                       "08:00",
                       "09:10",
                       "10:15",
                       "11:30",
                       "12:45",
                       "14:15",
                       "15:30",
                       "17:00",
                       "18:30",
                       "20:00",
                       "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "07:00",
                        "08:00",
                        "09:10",
                        "10:15",
                        "11:30",
                        "12:45",
                        "14:15",
                        "15:15",
                        "18:00",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "08:00",
                        "12:00",
                        "15:15",
                        "20:35"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("TEI από ΜΕΡΑΡΧΙΑΣ", 10, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                       "07:25",
                       "07:45",
                       "08:00",
                       "08:15",
                       "08:45",
                       "09:15",
                       "09:45",
                       "10:15",
                       "10:45",
                       "11:15",
                       "11:45",
                       "12:15",
                       "12:45",
                       "13:15",
                       "13:45",
                       "14:15",
                       "14:45",
                       "15:15",
                       "15:45",
                       "16:15",
                       "16:45",
                       "17:15",
                       "17:45",
                       "18:15",
                       "18:45",
                       "19:15",
                       "19:45",
                       "20:15",
                       "20:45",
                       "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                         "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΛΑΙΚΗ ΑΓΟΡΑ", 13, "ΚΑΘΕ ΤΡΙΤΗ");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                       "7:15",
                        "7:25",
                        "7:35",
                        "7:45",
                        "7:55",
                        "8:05",
                        "8:15",
                        "8:25",
                        "8:35",
                        "8:45",
                        "8:55",
                        "9:05",
                        "9:15",
                        "9:25",
                        "9:35",
                        "9:45",
                        "9:55",
                        "10:05",
                        "10:15",
                        "10:25",
                        "10:35",
                        "10:45",
                        "10:55",
                        "11:05",
                        "11:15",
                        "11:25",
                        "11:35",
                        "11:45",
                        "11:55",
                        "12:05",
                        "12:15",
                        "12:25",
                        "12:35",
                        "12:45",
                        "12:55",
                        "13:05",
                        "13:15",
                        "13:25",
                        "13:35",
                        "13:45",
                        "13:55",
                        "14:05",
                        "14:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                         "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΣΦΑΓΕΙΑ - ΤΕΙ - ΚΤΕΛ", 14, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "7:00",
                        "7:30",
                        "8:00",
                        "8:30",
                        "9:00",
                        "9:30",
                        "10:00",
                        "10:30",
                        "11:00",
                        "11:30",
                        "12:00",
                        "12:30",
                        "13:00",
                        "13:30",
                        "14:00",
                        "14:30",
                        "15:00",
                        "15:30",
                        "16:00",
                        "16:30",
                        "17:00",
                        "17:30",
                        "18:00",
                        "18:30",
                        "18:00",
                        "19:30",
                        "20:00",
                        "20:30",
                        "21:00",
                        "21:30"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "7:00",
                        "8:00",
                        "9:00",
                        "10:00",
                        "11:00",
                        "12:00",
                        "13:00",
                        "14:00",
                        "14:45",
                        "15:45",
                        "16:45",
                        "17:45",
                        "18:45",
                        "19:45",
                        "20:45"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "8:45",
                        "10:45",
                        "12:45",
                        "14:45",
                        "16:45",
                        "18:45"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΝΕΟΧΩΡΙ - ΜΟΝΟΒΡΥΣΗ", 15, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "6:10",
                        "7:05",
                        "8:10",
                        "9:35",
                        "11:05",
                        "12:05",
                        "13:05",
                        "14:15",
                        "15:30",
                        "17:00",
                        "18:30",
                        "20:00",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "7:05",
                        "8:10",
                        "9:35",
                        "11:05",
                        "12:05",
                        "13:05",
                        "14:15",
                        "16:15",
                        "17:00",
                        "20:35"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "10:00",
                        "15:15",
                        "20:35"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΚΡΙΝΟΣ", 16, "ΚΑΘΕ ΤΡΙΤΗ");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "8:30",
                        "12:30"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΝΕΟ ΣΟΥΛΙ", 17, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "6:10",
                        "7:05",
                        "8:10",
                        "8:50",
                        "9:35",
                        "10:15",
                        "11:10",
                        "12:10",
                        "13:10",
                        "14:15",
                        "15:05",
                        "16:15",
                        "17:15",
                        "18:15",
                        "19:30",
                        "20:35",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "6:10",
                        "7:05",
                        "8:10",
                        "8:50",
                        "9:35",
                        "10:15",
                        "11:10",
                        "12:10",
                        "13:10",
                        "14:15",
                        "15:10",
                        "17:10",
                        "19:10",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "9:15",
                        "11:15",
                        "14:15",
                        "18:15",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΝΟΣΟΚΟΜΕΙΟ", 18, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "6:30",
                        "6:45",
                        "7:00",
                        "7:15",
                        "7:30",
                        "7:45",
                        "8:00",
                        "8:15",
                        "8:30",
                        "8:45",
                        "9:00",
                        "9:15",
                        "9:30",
                        "9:45",
                        "10:00",
                        "10:15",
                        "10:30",
                        "10:45",
                        "11:00",
                        "11:15",
                        "11:30",
                        "11:45",
                        "12:00",
                        "12:15",
                        "12:30",
                        "12:45",
                        "13:00",
                        "13:15",
                        "13:30",
                        "13:45",
                        "14:00",
                        "14:15",
                        "14:30",
                        "14:45",
                        "15:00",
                        "15:30",
                        "16:00",
                        "16:30",
                        "17:00",
                        "17:30",
                        "18:00",
                        "18:30",
                        "19:00",
                        "19:30",
                        "20:00",
                        "20:30",
                        "21:00",
                        "21:30",
                        "22:00",
                        "22:40"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "6:30",
                        "6:45",
                        "7:00",
                        "7:30",
                        "8:00",
                        "8:30",
                        "9:00",
                        "9:30",
                        "10:00",
                        "10:30",
                        "11:00",
                        "11:30",
                        "12:00",
                        "12:30",
                        "13:00",
                        "13:30",
                        "14:00",
                        "14:30",
                        "14:45",
                        "15:45",
                        "16:45",
                        "17:45",
                        "18:45",
                        "19:45",
                        "20:45",
                        "21:45",
                        "22:40"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "6:45",
                        "8:45",
                        "10:45",
                        "12:45",
                        "13:45",
                        "14:45",
                        "16:45",
                        "17:45",
                        "18:45",
                        "20:45",
                        "22:40"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΑΓ. ΙΩΑΝΝΗΣ", 20, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "6:30",
                        "7:45",
                        "8:15",
                        "9:15",
                        "9:45",
                        "10:15",
                        "11:15",
                        "11:45",
                        "12:15",
                        "12:45",
                        "13:45",
                        "14:15",
                        "15:15",
                        "15:45",
                        "16:15",
                        "16:45",
                        "17:45",
                        "18:15",
                        "18:45",
                        "19:45",
                        "20:15",
                        "20:45",
                        "21:50"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "6:30",
                        "7:45",
                        "8:15",
                        "9:15",
                        "9:45",
                        "10:15",
                        "11:15",
                        "11:45",
                        "12:15",
                        "12:45",
                        "13:45",
                        "14:15",
                        "15:15",
                        "16:15",
                        "18:15",
                        "20:15",
                        "21:50"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "9:15",
                        "15:15",
                        "19:15",
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΑΓΙΟΣ ΙΩΑΝΝΗΣ - ΟΙΝΟΥΣΑ", 14, "");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "7:15",
                        "8:45",
                        "10:45",
                        "13:15",
                        "14:45",
                        "17:15",
                        "19:15",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "7:15",
                        "8:45",
                        "10:45",
                        "13:15",
                        "14:45",
                        "17:15",
                        "19:15",
                        "21:15",
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "8:15",
                        "11:15",
                        "13:15",
                        "17:15",
                        "21:15"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            // --------------------------------------------------------------------- Line Begin
            Line = new LineTimetable("ΒΙΟΜΗΧΑΝΙΚΗ ΠΕΡΙΟΧΗ", 23, "Το 7:05 μέσω του 2");
            Line.addDay(
                "ΚΑΘΗΜΕΡΙΝΕΣ",
                new String[][]
                    {
                    new String[] {
                        "7:05",
                        "15:40"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 }
            );
            Line.addDay(
                "ΣΑΒΒΑΤΟ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            Line.addDay(
                "ΚΥΡΙΑΚΗ",
                new String[][]
                    {
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    },
                    new String[] {
                        "ΜΗ ΔΙΑΘΕΣΙΜΟ"
                    }
                 });
            LineTimetables.Add(Line);
            // --------------------------------------------------------------------- Line End

            foreach (var line in LineTimetables)
            {
                Schedules_Menu.Items.Add(line.Number + " - " + line.Name);
            }
        }

        private void Schedules_Menu_SelectionChanged(object sender, SelectionChangedEventArgs e)
        {
            if (Schedules_Menu.SelectedIndex > -1)
            {
                String Selected = Schedules_Menu.SelectedItem.ToString();
                foreach (var Line in LineTimetables)
                {
                    if (Selected.Equals(Line.Number + " - " + Line.Name))
                    {
                        lineControl.Initialize(Line);
                        showLine();
                    }
                }
            }
        }

        public bool isListVisible()
        {
            return (Schedules_Menu.Visibility == Visibility.Visible);
        }

        public void showList()
        {
            Schedules_Menu.Visibility = Visibility.Visible;
            Schedules_Msg.Visibility = Visibility.Visible;

            lineControl.Visibility = Visibility.Collapsed;
            Schedules_Menu.SelectedIndex = -1;
        }

        public void showLine()
        {
            
            Schedules_Menu.Visibility = Visibility.Collapsed;
            Schedules_Msg.Visibility = Visibility.Collapsed;

            lineControl.Visibility = Visibility.Visible;
        }
    }
}
